bench/results/java17/20260309T232657Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "duration_s": 120, "warmup_s": 60, "concurrency": 25, "threads": 4, "requests_per_sec": 6507.02, "p50": "3.47ms", "p95": "6.73ms", "p99": "8.00ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 2m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     3.70ms    1.48ms  82.20ms   76.25%\n    Req/Sec     1.63k   153.34     1.92k    76.23%\n  Latency Distribution\n     50%    3.47ms\n     75%    4.42ms\n     90%    5.46ms\n     99%    8.00ms\n  781071 requests in 2.00m, 178.03MB read\nRequests/sec:   6507.02\nTransfer/sec:      1.48MB"}